Rhino.Inside.Revit API
ColorConverter.ToColor Method (Color)
 Converts the specified Eto.Drawing.Color to an equivalent Autodesk.Revit.DB.Color.
 Namespace: RhinoInside.Revit.Convert.Eto.Drawing
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Autodesk.Revit.DB.Color ToColor(
	this Eto.Drawing.Color color
)
@staticmethod
def ToColor(
	color: Eto.Drawing.Color
) -> Autodesk.Revit.DB.Color
Parameters
color
Type: Eto.Drawing.Color
Eto color to convert.
Return Value
Type: Autodesk.Revit.DB.Color
Revit color that is equivalent to the provided Eto color.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Eto.Drawing.Color. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToColor(Color) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Eto.Drawing;
DB.Color revitColor = etoColor.ToColor();
import clr
clr.AddReference("Eto")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
from Eto.Drawing import Color
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Eto.Drawing
clr.ImportExtensions(RhinoInside.Revit.Convert.Eto.Drawing)
revit_color = eto_color.ToColor()    # type: DB.Color
 Using ToColor(Color) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Eto.Drawing;
DB.Color revitColor = ColorConverter.ToColor(etoColor)
import clr
clr.AddReference("Eto")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
from Eto.Drawing import Color
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Eto.Drawing.ColorConverter as CC
revit_color = CC.ToColor(eto_color)    # type: DB.Color
See Also
Reference
ColorConverter Class
ToColor Overload
RhinoInside.Revit.Convert.Eto.Drawing Namespace